[
    {"Keyword":"Haste","Content":"No summoning sickness, can tap the turn it is played"},
    {"Keyword":"Ward","Content":"Triggered ability where if an opponent were to target the creature with a spell or ability, they must pay the ward cost"},
    {"Keyword":"Lifelink","Content":"Damage dealt by a source with lifelink causes the owner to gain that much life"},
    {"Keyword":"Flying","Content":"Can't be blocked by creatures without flying or reach"},
    {"Keyword":"Menace","Content":"Can't be blocked except by two or more creatures"},
    {"Keyword":"Devotion","Content":"Refers to the number of mana symbols of the costs of permanents a player controls"},
    {"Keyword":"First-Strike","Content":"Creature deals damage before creatures without first strike"},
    {"Keyword":"Double-Strike","Content":"Creature gets first strike and normal combat phase"},
    {"Keyword":"Reach","Content":"Can block Flying creatures"},
    {"Keyword":"Unearth","Content":"Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield."},
    {"Keyword":"Deathtouch","Content":"Any amount of damage dealt by this source to a creature will be lethal"},
    {"Keyword":"Shroud","Content":"Cannot be targeted of spells or abilities from anyone"},
    {"Keyword":"Defender","Content":"Creature cannot attack"},
    {"Keyword":"Vigilance","Content":"Does not tap when attacking"},
    {"Keyword":"Indestructible","Content":"Cannot be destroyed by spells, abilities or damage"},
    {"Keyword":"Trample","Content":"This creature can deal excess combat damage to a player, planeswalker or battle it's attacking."},
    {"Keyword":"Fight","Content":"Each deals damage equal to its power to the other."},
    {"Keyword":"Expend","Content":"You expend N as you spend your Nth total mana to cast spells during a turn"},
    {"Keyword":"Cycling","Content":"Discard this card: Draw a card"},
    {"Keyword":"Bestow","Content":"If you cast this card for its bestow cost, it's an Aura spell with enchant creature. It becomes a creature again if it's not attached to a creature."},
    {"Keyword":"Adapt","Content":"If this creature has no +1/+1 counters on it, put N +1/+1 counter(s) on it."},
    {"Keyword":"Encore","Content":"Exile card from graveyard, for each opponent create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step."},
    {"Keyword":"Storm","Content":"When you cast this spell, copy it for each spell cast before it this turn."},
    {"Keyword":"Escape","Content":"You may cast this card from your graveyard for its escape cost."},
    {"Keyword":"Kicker","Content":"You may pay an additional [cost] as you cast this spell."},
    {"Keyword":"Equip","Content":"Attach equipment to creature"},
    {"Keyword":"Foretell","Content":" pay N and exile this card from your hand face down. Cast it on a later turn for its foretell cost."},
    {"Keyword":"Myriad","Content":"When this creature attacks, create copy of creature for other defending player(s) tapped and attacking, exile these tokens at the end of combat"},
    {"Keyword":"Gift","Content":"You may promise an opponent a gift as you cast this spell. If you do, they [get whatever you're gifting them]."},
    {"Keyword":"Toxic","Content":"Combat damage from creature to player will also give them N poison counters"},
    {"Keyword":"Changeling","Content":"This card is every creature type"},
    {"Keyword":"Ravenous","Content":"This creature enters with X +1/+1 counters on it. If X is 5 or more, draw a card when it enters."},
    {"Keyword":"Devoid","Content":"This card is has no colour"},
    {"Keyword":"Persist","Content":"When this creature dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner's control with a -1/-1 counter on it."},
    {"Keyword":"Explores","Content":"Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on the exploring creature, then put the card back or put it into your graveyard."},
    {"Keyword":"Protection","Content":"This can't be blocked, targeted, dealt damage, enchanted, or equipped by anything it is protected from"},
    {"Keyword":"Discover","Content":"Exile cards from the top of your library until you exile a nonland card with that mana value or less. Cast it without paying its mana cost or put it into your hand. Put the rest on the bottom in a random order."},
    {"Keyword":"Skulk","Content":"This creature can't be blocked by creatures with greater power"},
    {"Keyword":"Exert","Content":"An exerted creature won't untap during your next untap step."},
    {"Keyword":"Annihilator","Content":"Whenever this creature attacks, defending player sacrifices N permanents."},
    {"Keyword":"Emerge","Content":"You may cast this spell by sacrificing a creature and paying the emerge cost reduced by that creature's mana value."},
    {"Keyword":"Bloodthirst","Content":"If an opponent was dealt damage this turn, that creature enters with N additional +1/+1 counters on it."},
    {"Keyword":"Fabricate","Content":"When this creature enters, put N +1/+1 counters on it or create two 1/1 colorless Servo artifact creature tokens."},
    {"Keyword":"Populate","Content":"Create a token that's a copy of a creature token you control."},
    {"Keyword":"Plot","Content":"Pay cost to exile this card from your hand. Cast it as a sorcery on a later turn without paying its mana cost. Plot only as a sorcery."},
    {"Keyword":"Proliferate","Content":"Choose any number of permanents and/or players, then give each another counter of each kind already there."},
    {"Keyword":"Overload","Content":"You may cast this spell for its overload cost. If you do, change target in its text to each."},
    {"Keyword":"Cascade","Content":"When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom in a random order."},
    {"Keyword":"Retrace","Content":"You can cast this card from graveyard by paying its cost and discarding a land"},
    {"Keyword":"Goad","Content":"Until your next turn, that creature attacks each combat if able and attacks a player other than you if able."},
    {"Keyword":"Hexproof","Content":"This object can't be the target of spells or abilities your opponents control."},
    {"Keyword":"Flash","Content":"You may cast this spell any time you could cast an instant."},
    {"Keyword":"Evolve","Content":"Whenever a creature you control enters, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature."},
    {"Keyword":"Miracle","Content":"You may cast this card for its Miracle cost when you draw it if it's the first card you drew this turn."},
    {"Keyword":"Surveil","Content":"ook at the top N cards of your library, then put any number of them into your graveyard and the rest on top of your library in any order."},
    {"Keyword":"Delve","Content":"ach card you exile from your graveyard while casting this spell pays for 1 generic"},
    {"Keyword":"Manifest","Content":"Put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card."},
    {"Keyword":"Manifest-Dread ","Content":"Look at the top two cards of your library. Put one onto the battlefield face down as a 2/2 creature and the other into your graveyard. Turn it face up any time for its mana cost if it’s a creature card."},
    {"Keyword":"Flashback","Content":"Play card from graveyard for flashback cost, then exile it."},
    {"Keyword":"Morph","Content":"You may cast this face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost."},
    {"Keyword":"Megamorph","Content":"You may cast this card face down as a 2/2 creature for {3}. Turn it face up at any time for its megamorph cost and put a +1/+1 counter on it."},
    {"Keyword":"Monstrosity","Content":"If this permanent isn't monstrous, put N +1/+1 counters on it and it becomes monstrous."},
    {"Keyword":"Suspend","Content":"Rather than cast this card from your hand, you may pay [cost] and exile it with N time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, you may cast it without paying its mana cost. It has haste."},
    {"Keyword":"Spectacle","Content":"You may cast this spell for its spectacle cost rather than its mana cost if an opponent lost life this turn"},
    {"Keyword":"Blitz","Content":"If you cast this spell for its blitz cost, it gains haste and 'When this creature dies, draw a card. Sacrifice it at the beginning of the next end step.'"},
    {"Keyword":"Undying","Content":"When this creature dies, if it had no +1/+1 counters on it, return it to the battlefield under its owner's control with a +1/+1 counter on it."},
    {"Keyword":"Explore","Content":"Reveal the top card of your library. Put that card into your hand if it's a land. Otherwise, put a +1/+1 counter on this creature, then put the card back on top or into your graveyard."},
    {"Keyword":"Scry","Content":"Look at the top N cards of your library, then put any number of them on the bottom of your library and the rest on top in any order."},
    {"Keyword":"Crew","Content":"Tap any number of other untapped creatures you control with total power N or greater: This permanent becomes an artifact creature until end of turn."},
    {"Keyword":"Ascend","Content":"If you control ten or more permanents, you get the city’s blessing for the rest of the game."},
    {"Keyword":"Offspring","Content":"You may pay an additional [cost] as you cast this spell. If you do, when this creature enters, create a 1/1 token copy of it."},
    {"Keyword":"Hideaway","Content":"When this permanent enters the battlefield, look at the top N cards of your library, exile one face down, then put the rest on the bottom of your library."}
    
]
